<?php

declare(strict_types=1);

return [
    'locale' => 'el-GR',
    'date' => [
        'formats' => [
            'short' => 'd/m/Y',
            'medium' => 'd/m/Y',
            'long' => 'j F Y',
        ],
        'long_month_case' => 'genitive',
        'months_genitive' => [
            1 => 'Ιανουαρίου',
            2 => 'Φεβρουαρίου',
            3 => 'Μαρτίου',
            4 => 'Απριλίου',
            5 => 'Μαΐου',
            6 => 'Ιουνίου',
            7 => 'Ιουλίου',
            8 => 'Αυγούστου',
            9 => 'Σεπτεμβρίου',
            10 => 'Οκτωβρίου',
            11 => 'Νοεμβρίου',
            12 => 'Δεκεμβρίου',
        ],
        'months_nominative' => [
            1 => 'Ιανουάριος',
            2 => 'Φεβρουάριος',
            3 => 'Μάρτιος',
            4 => 'Απρίλιος',
            5 => 'Μάιος',
            6 => 'Ιούνιος',
            7 => 'Ιούλιος',
            8 => 'Αύγουστος',
            9 => 'Σεπτέμβριος',
            10 => 'Οκτώβριος',
            11 => 'Νοέμβριος',
            12 => 'Δεκέμβριος',
        ],
    ],
    'time' => [
        'formats' => [
            'short' => 'H:i',
            'medium' => 'H:i:s',
            'long' => 'H:i:s',
        ],
    ],
    'number' => [
        'decimal_separator' => ',',
        'thousands_separator' => '.',
        'currency' => 'EUR',
        'fraction_digits' => 2,
    ],
];
